Revit 2027 API
CylindricalHelix.IsRightHanded Property
True if the helix is right handed, false if the helix is left handed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRightHanded { get; }
Public ReadOnly Property IsRightHanded As Boolean
	Get
public:
property bool IsRightHanded {
	bool get ();
}
member IsRightHanded : bool with get
Property Value
Boolean
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace